app/controllers/visitor_tables_controller.rb

SELECT "visitor_tables".* FROM "visitor_tables"
---
  def index
    @visitor_tables = VisitorTable.all

INSERT INTO "visitor_tables" ("name", "relation", "classification", "no_of_visits", "last_visited", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @visitor_table = VisitorTable.new(visitor_table_params)

    respond_to do |format|
      if @visitor_table.save

DELETE FROM "visitor_tables" WHERE "visitor_tables"."id" = $1  [["id", 1]]
---
  def destroy
    @visitor_table.destroy

SELECT "visitor_tables".* FROM "visitor_tables" WHERE "visitor_tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_visitor_table
      @visitor_table = VisitorTable.find(params[:id])